class PrivacyPolicyText {
  static String getPrivacyText() {
    return '''
بموجب  هذه الاتفاقية  يقدم  شركة اكسيم بجمهورية مصر العربية  لمستخدميه خدمات الإبلاغ أو البحث عن  الاشخاص او الأشياء المفقودة، وذلك عن طريق اختيار "الإبلاغ عن مفقودين / مفقوداتي" أو "الإبلاغ عن عثوري على مفقود"، ونقدم خدمات التطبيق وفق الشروط والأحكام الآتية:
1-   يشير مصطلح "مفقود" أو "التطبيق" أو "نحن" أو "ضمير المتكلم" أو "ضمير الملكية": يشير إلى تطبيق تلاقي  بجمهورية مصر العربية ، كما يشير مصطلح "أنت" أو "المستخدم" أو "ضمير الملكية للمخاطب إلى كل شخص يزور تلاقي أو يستخدمه أو يقوم بالإبلاغ عن المفقودات  او الإبلاغ عن الأشخاص المفقودة الخاصة به أو يقوم بالإبلاغ عن المفقودات  او الأشخاص التي عثر عليها.
2 -  يجب أن يكون الإبلاغ عن المفقودات  / الاشخاص متوافق مع الفئات المسموح بالإبلاغ عنها من خلال التطبيق والتي تشمل ( اشخاص / لابتوبات، جوالات، مستلزمات نسائية، نقود ومحافظ، مستلزمات شخصية، حيوانات مفقودة) وأي فئات أخرى يتم إضافتها من جانب التطبيق)، وتقدم خدمات الإبلاغ عبر التطبيق بشكل مجاني للمستخدمين، ويجب أن يندرج الإبلاغ تحت الفئة المناسبة له، ويحق للتطبيق نقل الإبلاغ إلى الفئة المناسبة له، كما يحق للتطبيق حذف الإبلاغ غير المتوافق مع هذه السياسة.
3- تقديم الإبلاغ من خلال التطبيق، يجب على المستخدم تسجيل حساب لدينا يتضمن (الاسم، رقم الجوال ، العنوان "يجب أن يكون مصري "، والدولة "يجب أن تكون جمهورية مصر العربية ، والمدينة "يجب أن تكون داخل جمهورية مصر العربية ، كلمة المرور، والموافقة على الشروط والأحكام)، ويجب أن تكون البيانات التي يقدمها لنا المستخدم خاصة به ودقيقة ومحدثة في جميع الأوقات، ويتعهد المستخدم بعدم تفويض غيره باستخدام حسابه بالتطبيق، ويكون المستخدم مسئول بشكل كامل عن أي إبلاغ يتم من خلال حسابه بالتطبيق.
4-حظر الإبلاغ عن مفقودات  او اشخاص مفقودة تكون في يد السلطات المختصة داخل جمهورية مصر العربية  أو تكون محل تحقيقات قضائية أو صدر بشأنها حكم بالمصادرة أو التحفظ أو غير ذلك من القرارات الصادرة عن الجهات المختصة.
5- جب أن تكون المفقودات  / الاشخاص  تخص المستخدم الذي قدم الإبلاغ عنها، أو يكون مفوضًا قانونًا بالبحث عنها نيابة عن صاحبها ذويها  من خلال التطبيق. ويجب أن يقدم المحتوى الخاص بالإبلاغ عن المفقودات او الاشخاص المفقودة أو العثور عليها على مسؤولية المستخدم، ولا يقدم التطبيق أي ضمانات بشأن دقة  أو جدية هذا المحتوى.
 
6 -  يتم التواصل بين الأطراف من خلال التطبيق عبر الرسائل، والتطبيق لا يقدم أي ضمانات بشأن عملية التواصل من خلال التطبيق، ويقتصر دورنا على إدارة التطبيق وتوفيره من الناحية التقنية، ولا يتدخل التطبيق في عمليات الإبلاغ التي تتم من خلاله؛ فهي تقدم على مسؤولية المبلغ، ويتم تسليم المفقودات  او الاشخاص المفقودة بين الأطراف دون تدخل من جانب التطبيق، ويجب على الشخص الذي عثر على المفقودات  او الاشخاص المفقودة التحقق بشكل كامل وبكافة الضمانات عن ذوي الاشخاص المفقودة او  صاحب الأشياء المفقودة، كما يجب أن يتم أي تواصل مباشر بين الأطراف في أماكن آمنة وعلى مسئوليتهم.
7- حظر إضافة أي محتوى أو تعليقات تتضمن إساءة للتطبيق أو أي من المستخدمين أو أي من الأفراد أو الجهات الحكومية وغير الحكومية الأخرى، وفي حالة اكتشاف هذا النوع من المحتوى سنقوم بحذفه مع حظر عضوية المستخدم دون تقديم أي إخطارات له واتخاذ الإجراءات القانونية .
 
8- يجب أن يستخدم التطبيق والخدمات المقدمة من خلاله للأغراض المعلن عنها من خلال التطبيق، وبالتالي يحظر إساءة استخدام خدماتنا بأي شكل من الأشكال، كما يحظر استخدام خدمة الإبلاغ لأغراض إزعاج الأشخاص الآخرين كما يحظر استخدام خاصية الرسائل لأي أغراض أخرى غير متعلقة بالإبلاغ كنشر المحتوى الدعائي أو التعارف أو لأغراض التواصل الخارجي غير المشروع، وللتطبيق حق مراقبة المحتوى والرسائل المقدمة من خلال التطبيق.
9- لتطبيق والأفكار المُعبَر عنها داخله وكافة عناصر التطبيق المادية والمعنوية والمحتوى المقدم من خلاله هي حقوق ملكية فكرية خالصة لشركة اكسيم ، ونحتفظ بحقوق التأليف والنشر عليها وهي محمية بموجب القوانين المصرية والقوانين والمعاهدات الدولية، وبالتالي لا يجوز لك نسخها أو نشرها أو تعديلها أو تداولها بأي شكل من الأشكال دون الحصول على موافقة صريحة من تطبيق مفقود، ويعد أي تقليد أو اقتباس للتطبيق أو تصميمه أو محتوياته أو بعض خدمات التطبيق أو بعض صفحاته (بما في ذلك الأفكار والنصوص والرموز والبرمجيات او العلامات التجارية ) يعد انتهاكًا لحقوق التأليف والنشر الخاصة بنا، ويحق لنا معه اتخاذ كافة الإجراءات القانونية.
10-  يلتزم المستخدم بتعويض اكسيم عن كافة الأضرار التي تصيبه نتيجة سوء استخدام التطبيق أو المحتوى أو أي من خدماتنا، كما يلتزم بتعويضنا عن أي دعاوى أو مطالبات يرفعها الغير نتيجة سوء استخدامه للتطبيق أو أي أفعال متعمدة أو إهمال، بما في ذلك تحملك كافة المصاريف القضائية وأتعاب المحاماة. 
11- في حال قيامك بالتواصل معنا أو تزويدنا ببيانات الاتصال بك سواء أثناء التسجيل بالتطبيق أو في أي وقت من الأوقات فأنت توافق على التواصل معنا سواء إلكترونيًا أو هاتفيًا، وسوف نقوم بتزويدك بأي إجابات أو إشعارات مطلوبة من خلال وسائل الاتصال التي زودتنا بها، وتحل هذه الإخطارات والإشعارات محل أي إخطارات أو إشعارات خطية مطلوبة، كما أنه في حالة رغبة المستخدم في تقديم إخطارات أو إشعارات لتطبيق "مفقود" يجب أن تتم من خلال وسائل الاتصال المحددة من جانبنا عبر التطبيق.
 
(18) يحق لتطبيق "اكسيم  في أي وقت تعديل أي شروط أو بنود في هذه الاتفاقية، أو إضافة أي بنود أو شروط جديدة أو إلغاء أو حذف أي من البنود القائمة، وسنقوم في هذه الحالة بتحديث "تاريخ أخر تحديث" أعلى هذه الوثيقة، لذا يجب عليك مراجعة هذا التاريخ في كل مرة تزور فيها التطبيق، كما يحق لنا في جميع الأوقات ودون إخطار تعديل أو من خدماتنا أو تغيير النشاط أو إلغاء هذه الاتفاقية بشكل كامل. 
12- يحكم هذه  الاتفاقية القواعد و القوانين المعمول بها والسارية المفعول داخل جمهورية مصر العربية  ويختص القضاء المصري  بأي نزاع قد ينشأ عن تفسير أو تنفيذ أحكام هذه الاتفاقية، ولا يخل استبعاد أي بند بموجب حكم قضائي من إعمال الآثار القانونية للبنود الأخرى المتاحة في الاتفاقية.
    ''';
  }

  static String getPolicyText() {
    return '''
      Terms of Service
      
      These are the terms and conditions for using our app. 
      By using the app, you agree to abide by these terms.
      
      Thank you.
    ''';
  }
}
